<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"

"http://www.w3.org/TR/html4/loose.dtd">

<html><!-- InstanceBegin template="/Templates/huang.dwt" codeOutsideHTMLIsLocked="false" -->

<head>

<meta http-equiv="content-type" content="text/html; charset=utf-8" />

<!-- InstanceBeginEditable name="doctitle" -->

<title>Reverend William Huang - Murder Case Information</title>

<!-- InstanceEndEditable -->

<!-- InstanceBeginEditable name="head" -->



<!-- InstanceEndEditable -->

<link href="/css/css.css" rel="stylesheet" type="text/css">

</head>



<body>

<table width="800"  border="0" align="center" cellpadding="0" cellspacing="0">

  <tr>

    <td height="50" class="banner-title"><div align="center">Reverend William Huang</div></td>

  </tr>

  <tr>

    <td style="background-color:#7B684D"><div align="center"><a href="/" class="alite">Home</a>
        | <a href="life.htm" class="alite">Life Story</a> | <a href="case.htm" class="alite">Murder
        Case</a> | <a href="media.htm" class="alite">Media</a> | <a href="funeral.htm" class="alite">Funeral
        Service</a> | <a href="family.htm" class="alite">Family</a> | <a href="friends.htm" class="alite">Shared
        Thoughts</a> | <a href="guestbook.htm" class="alite">Guestbook</a> | <a href="updates.htm" class="alite">Updates</a>
        | <a href="mailto:revhuang@gmail.com" class="alite">Contact Us</a></div></td>

  </tr>

  <tr>

    <td><br><div align="center"><span class="inner-page-content-title-sub"><!-- InstanceBeginEditable name="title" -->Murder Case<!-- InstanceEndEditable --></span></div></td>

  </tr>

  <tr>

    <td><!-- InstanceBeginEditable name="body" --> 
      <p>ACONTECIMIENTOS de March 12, 2006<br>
          <br>
          Mi padre, el Reverendo Guillermo Huang, compro &ldquo;Lucky Seafood Market&rdquo; en diciembre del 2005 para mantener a la familia.Empezando en febrero del 2006 - mi padre finalmente pudo contratar a suficientes empleados a fin de que &eacute;l no tuviese que estar tan involucrado &ndash; esto le dio m&aacute;s tiempo para estar con la familia en las tardes. En la noche del asesinato, nuestra familia celebraba el d&eacute;cimo cumplea&ntilde;os de mi hermano menor. Aproximadamente a las 8:45pm, mi padre nos inform&oacute; que &eacute;l se iba a cerrar el negocio.</p>
      <p align="center"><img src="/images/andrade.jpg" width="263" height="333"></p>
      <p>Leon Lugo Andrad&eacute;, un hombre con una historia de violencia, llevaba mas de un a&ntilde;o con una orden de protecci&oacute;n en su contra por haberle pegado a su esposa e hijos regularmente a lo largo de su matrimonio . En Houston solamente, Andrad&eacute; tiene un largo registro criminal comenzando con un asesinato cometido 15 a&ntilde;os atr&aacute;s, tambi&eacute;n con numerosos DWI's, mas cargos por disparar una arma y llevar una escopeta en un lugar p&uacute;blico. Cuando su esposa finalmente le dej&oacute;, &eacute;l se volvi&oacute; cada vez mas amenazador, obligando a su ex esposa y sus ni&ntilde;os a mudarse amenudamente. Cuando Andrad&eacute; finalmente localiz&oacute; la hermana de su ex esposa, la amenaz&oacute; con un arma mientras intentaba localizar a su ex esposa. Recientemente la ex esposa fue contratada por mi pap&aacute; y la hija iba a la tienda todos los d&iacute;as despu&eacute;s de la escuela para estar con su mam&aacute;. La madre le hab&iacute;a contado a mi pap&aacute; sobre su marido abusivo y c&oacute;mo ella le tem&iacute;a&ndash; y que la polic&iacute;a nunca ayudaba ya que ellos siempre estaban un paso atr&aacute;s. <br>
        2.<br>
        El d&iacute;a del asesinato, Andrad&eacute; otra vez hab&iacute;a ido a la casa de la hermana de la ex esposa para amenazarla. Perturbada, la hermana fue a la tienda para advertirles a la ex esposa y la hija. La polic&iacute;a cree que Andrad&eacute; en ese momento la persigui&oacute; para el restaurante de mi pap&aacute; y esper&oacute; a que su ex esposa saliera. M&aacute;s tarde cuando mi pap&aacute; regres&oacute; al restaurante listo para cerrar, la hija le dijo que ella cre&iacute;a haber visto el coche de su padre en el &aacute;rea. Mi pap&aacute; se ofreci&oacute; a acompa&ntilde;arlas al coche para asegurarse de que llegar&aacute;n bien. Inmediatamente despu&eacute;s de que mi pap&aacute; termin&oacute; de cerrar las puertas, un Andrad&eacute; ebrio apareci&oacute; y comenz&oacute; a discutir con su esposa en espa&ntilde;ol y preguntar qui&eacute;n era mi padre. La hija y la madre insistieron en que &eacute;l era simplemente su jefe. &iexcl;La hija luego abraz&oacute; a su padre y le dijo en espa&ntilde;ol, &ldquo; &eacute;l es el jefe nuevo de Mam&aacute; porque usted nunca nos da dinero!!&rdquo; En este momento Andrade comenz&oacute; a mostrarse violento hacia su ex esposa y mi pap&aacute; intent&oacute; de intervenir para protegerla. Andrade amenazo a mi padre y la hija le hizo la sugerencia de que se fuera antes de que algo le sucediera. Sin embargo, un Andrad&eacute; ya salvaje se volc&oacute; hacia me padre. En ese momento, mi padre respondi&oacute; con una sugerencia de que se calmara ya que nadie quer&iacute;a problemas. Andrad&eacute; regres&oacute; a su camioneta, saco un machete y comenz&oacute; a perseguir a mi pap&aacute; alrededor del coche. La c&aacute;mara de vigilancia muestra que rodearon los autos varias veces durante la persecuci&oacute;n, y que mi pap&aacute; tuvo numerosas oportunidades para escapar. Eran solo 10:20pm cuando estos acontecimientos empezaron y hab&iacute;a toneladas de coches pasando a lo largo en la calle delante del estacionamiento. El polic&iacute;a, la madre, y la hija est&aacute;n de acuerdo que mi pap&aacute; tem&iacute;a por la vida de la esposa y rode&oacute; los autos para permanecer cerca de ella. Eventualmente, mi pap&aacute; se cay&oacute;. Andrad&eacute; lo forz&oacute; callej&oacute;n que queda al lado del restaurante y le golpe&oacute; m&uacute;ltiples soplos a la cabeza. Mi pap&aacute; trat&oacute; de defenderse colocando sus brazos para bloquear el machete, y recibi&oacute; grandes cuchilladas en sus manos y antebrazos perdiendo su pulgar. El lado derecho de su cara hab&iacute;a sido cortada en 3 lugares. La parte trasera de su cr&aacute;neo hab&iacute;a sido destrozada dejando un hueco en la parte trasera de su cabeza. Andrad&eacute; inmediatamente se march&oacute; en su camioneta verde cuando los testigos comenzaron a aparecer despu&eacute;s de o&iacute;r los gritos de las mujeres. Las acciones de mi pap&aacute; hab&iacute;an salvado la vida de la mujer y su hija. Un testigo lleg&oacute; a la escena para presenciar el &uacute;ltimo golpe del machete y logro anotar la matr&iacute;cula de la camioneta verde mientras Andrad&eacute; escapaba. La hija explic&oacute; c&oacute;mo Andrade no pod&iacute;a aceptar el hecho de que no era el due&ntilde;o de su mama y de que ya no depend&iacute;an de el. </p>
      <p>Mi madre se despert&oacute; alrededor de 4:00AM ma&ntilde;ana del lunes
        lista para viajar a su trabajo y se fij&oacute; que mi pap&aacute; no
        hab&iacute;a vuelta a la casa. Ella llam&oacute; a su tel&eacute;fono
        celular y al tel&eacute;fono del restaurante y comenz&oacute; a preocuparse
        que un accidente le haya sucedido camino a casa. Despu&eacute;s de varios
        intentos m&aacute;s sin respuesta, ella decidi&oacute; conducir hacia
        el restaurante y se detuvo en un estacionamiento donde hab&iacute;a varias
        tripulaciones de los medios de comunicaci&oacute;n locales y dos guardias
        de seguridad &ndash; No hab&iacute;a ning&uacute;n signo de presencia
        policial. Ella recibi&oacute; indicios de un reportero de que un hombre
        nombrado Elvis (el apodo de mi pap&aacute;) hab&iacute;a sido asesinado
        pero ella no lo crey&oacute; ya que nadie le hab&iacute;a notificado.
        La polic&iacute;a lleg&oacute; a la escena despu&eacute;s de que el guardia
        de seguridad les notific&oacute;. La polic&iacute;a luego llam&oacute;
        a mi hermana, Jade y le pidi&oacute; que fuese a la escena. Cuando Jade
        lleg&oacute;, la polic&iacute;a confirmo que era cierto que mi pap&aacute;
        hab&iacute;a sido asesinado mientras trataba de proteger a la ex-esposa
        y su hija.</p>
      <!-- InstanceEndEditable --></td>

  </tr>

  <tr>

    <td>&nbsp;</td>

  </tr>

</table>






<script src="http://www.google-analytics.com/urchin.js" type="text/javascript">
</script>
<script type="text/javascript">
_uacct = "UA-498202-2";
urchinTracker();
</script>
</body>

<!-- InstanceEnd --></html>
