<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"

"http://www.w3.org/TR/html4/loose.dtd">

<html><!-- InstanceBegin template="/Templates/huang.dwt" codeOutsideHTMLIsLocked="false" -->

<head>

<meta http-equiv="content-type" content="text/html; charset=utf-8" />

<!-- InstanceBeginEditable name="doctitle" --> 
<title>Reverend William Huang - Life Story</title>
<!-- InstanceEndEditable -->

<!-- InstanceBeginEditable name="head" --> 
<style type="text/css">
<!--
.left {
	text-align: left;
	padding: 1em;
}
-->
</style>
<!-- InstanceEndEditable -->

<link href="/css/css.css" rel="stylesheet" type="text/css">

</head>



<body>

<table width="800"  border="0" align="center" cellpadding="0" cellspacing="0">

  <tr>

    <td height="50" class="banner-title"><div align="center">Reverend William Huang</div></td>

  </tr>

  <tr>

    <td style="background-color:#7B684D"><div align="center"><a href="/" class="alite">Home</a> 
        | <a href="life.htm" class="alite">Life Story</a> | <a href="case.htm" class="alite">Murder 
        Case</a> | <a href="media.htm" class="alite">Media</a> | <a href="funeral.htm" class="alite">Funeral 
        Service</a> | <a href="family.htm" class="alite">Family</a> | <a href="friends.htm" class="alite">Shared 
        Thoughts</a> | <a href="guestbook.htm" class="alite">Guestbook</a> | <a href="updates.htm" class="alite">Updates</a> 
        | <a href="mailto:revhuang@gmail.com" class="alite">Contact Us</a></div></td>

  </tr>

  <tr>

    <td><br><div align="center"><span class="inner-page-content-title-sub"><!-- InstanceBeginEditable name="title" --> 
        &#40643;&#33288;&#32173;&#29287;&#24107;&#29983;&#24179;<!-- InstanceEndEditable --></span></div></td>

  </tr>

  <tr>

    <td><!-- InstanceBeginEditable name="body" --> 
      <p align="center"><a href="life.htm">English</a> | <a href="life-spanish.htm"> 
        Espa&ntilde;ol </a> | &#20013;&#25991; </p>
      <p align="center"> <a href="downloads/dad%20slideshow_SMALLer.ppt" target="_blank">Powerpoint 
        &#24187;&#29128;&#31680;&#30446;</a><br>
        (12.7 MB) </p>
      <p align="left"><img src="images/1948-1.jpg" width="200" height="411" align="left" class="left"></p>
      <p align="left">&#40643;&#33288;&#32173;&#29287;&#24107;&#65292;&#24291;&#26481;&#27138;&#26124;&#35199;&#37129;&#22612;&#38957;&#26449;&#20154;&#12290;&#19968;&#20061;&#22235;&#22235;&#24180;&#21313;&#19968;&#26085;&#24319;&#26085;&#29983;&#26044;&#28246;&#21335;&#34913;&#38525;&#65292;&#28858;&#23478;&#20013;&#27425;&#23376;&#65292;&#20294;&#30001;&#26044;&#38263;&#20804;&#32633;&#24739;&#33126;&#33180;&#28814;&#65292;&#24418;&#25104;&#26234;&#24369;&#65292;&#29287;&#24107;&#33258;&#28982;&#25104;&#28858;&#23478;&#20013;&#38263;&#23376;&#30340;&#32887;&#20301;&#65292;&#20134;&#25104;&#28858;&#24351;&#22969;&#20497;&#24515;&#20013;&#25964;&#20329;&#30340;&#33521;&#38596;&#20154;&#29289;&#12290;&#33258;&#24188;&#38568;&#29238;&#35242;&#36557;&#38538;&#25764;&#36864;&#33267;&#28023;&#21335;&#23798;&#65292;&#23601;&#35712;&#23567;&#23416;&#65307;&#24460;&#20877;&#32147;&#30001;&#39321;&#28207;&#36983;&#33267;&#21488;&#28771;&#65292;&#23450;&#23621;&#20013;&#22754;&#12290;&#29287;&#24107;&#33258;&#24188;&#32880;&#26126;&#36942;&#20154;&#65292;&#19977;&#27506;&#26178;&#24050;&#33021;&#35469;&#35672;&#20013;&#22283;&#23383;&#21315;&#23383;&#21315;&#23383;&#20197;&#19978;&#65292;&#20006;&#33021;&#21561;&#21475;&#21736;&#12290;&#28145;&#21463;&#38263;&#36649;&#21450;&#35242;&#26379;&#30340;&#23541;&#24859;&#12290;&#29238;&#35242;&#40643;&#26124;&#20754;&#65292;&#38520;&#36557;&#20013;&#23559;&#65292;&#40643;&#22484;&#20108;&#26399;&#65292;&#25239;&#26085;&#25136;&#29229;&#38263;&#27801;&#19977;&#27425;&#22823;&#25463;&#30340;&#21517;&#23559;&#12290;&#27597;&#35242;&#22196;&#33258;&#33521;&#22899;&#22763;&#65292;&#26159;&#22196;&#30008;&#21335;&#23559;&#36557;&#20043;&#22899;&#12290;&#29287;&#24107;&#33258;&#24188;&#24682;&#36981;&#29238;&#27597;&#22196;&#35641;&#30340;&#25945;&#32946;&#21644;&#35347;&#32244;&#65292;&#35433;&#35422;&#25991;&#31558;&#65292;&#22283;&#23416;&#26360;&#27861;&#65292;&#20840;&#23416;&#20043;&#26044;&#29238;&#35242;&#30340;&#31934;&#39635;&#65292;&#22880;&#23450;&#26085;&#24460;&#29287;&#24107;&#38596;&#21402;&#30340;&#22283;&#23416;&#22522;&#30990;&#21450;&#30693;&#35672;&#12290;&#29287;&#24107;&#25793;&#26377;&#19968;&#25163;&#31934;&#28251;&#30340;&#21416;&#34269;&#65292;&#23436;&#20840;&#26159;&#27597;&#35242;&#30340;&#30495;&#20659;&#12290;</p>
      <p>&#29287;&#24107;&#26044;&#19968;&#20061;&#20845;&#19971;&#24180;&#30050;&#26989;&#26044;&#20013;&#21407;&#29702;&#24037;&#23416;&#38498;&#21270;&#24037;&#31995;&#12290;&#22312;&#22823;&#23416;&#30050;&#26989;&#20043;&#21069;&#65292;&#25509;&#21463;&#32822;&#31308;&#22522;&#30563;&#25104;&#28858;&#20182;&#20491;&#20154;&#30340;&#25937;&#20027;&#65292;&#19968;&#29983;&#30690;&#24535;&#35201;&#25104;&#28858;&#19968;&#20491;&#27054;&#31070;&#30410;&#20154;&#30340;&#22522;&#30563;&#24466;&#12290;&#19968;&#20061;&#19971;O&#24180;&#36000;&#31496;&#32654;&#22283;&#21932;&#27835;&#20126;&#29702;&#24037;&#23416;&#38498;&#65292;&#19968;&#20061;&#19971;&#22235;&#24180;&#29554;&#24471;&#21270;&#24037;&#30889;&#22763;&#12290;&#30001;&#26044;&#19978;&#24093;&#30340;&#21628;&#21484;&#26085;&#30410;&#28165;&#26970;&#65292;&#29287;&#24107;&#36681;&#36212;&#21152;&#24030;&#65292;&#22312;&#38272;&#24466;&#20043;&#23478;&#20841;&#24180;&#65292;&#25509;&#21463;&#20659;&#36947;&#20154;&#30340;&#35347;&#32244;&#12290;&#19968;&#20061;&#19971;&#20845;&#24180;&#36983;&#20358;&#20241;&#26031;&#38931;&#23450;&#23621;&#65292;&#20854;&#38291;&#22312;&#25945;&#26371;&#20013;&#22810;&#37325;&#23831;&#20301;&#19978;&#20107;&#22857;&#65292;&#25945;&#23566;&#21644;&#29287;&#39178;&#12290;&#19968;&#20061;&#20843;&#20843;&#24180;&#22312;&#24800;&#38931;&#23416;&#38498;&#20027;&#20462;&#38651;&#35222;&#20659;&#25773;&#35069;&#20316;&#12290;&#19968;&#20061;&#20061;&#22235;&#24180;&#29287;&#39178;&#8220;&#26032;&#29983;&#21629;&#8221;&#28024;&#20449;&#26371;&#26178;&#65292;&#22312;&#35199;&#21335;&#31070;&#23416;&#38498;Dr.Walter 
        Lumpkin&#30435;&#31150;&#19979;&#65292;&#25353;&#29287;&#25104;&#28858;&#28024;&#20449;&#26371;&#29287;&#24107;&#65292;&#20006;&#26044;&#19968;&#20061;&#20061;&#20843;&#24180;&#29554;&#24471;&#35199;&#21335;&#31070;&#23416;&#38498;&#36947;&#23416;&#30889;&#22763;&#23416;&#20301;&#65292;&#24460;&#20006;&#32380;&#32396;&#36914;&#20462;&#21338;&#22763;&#35506;&#31243;&#12290; 
      </p>
      <p> &#19968;&#20061;&#19971;&#20843;&#24180;&#19968;&#26376;&#24319;&#20843;&#26085;&#65292;&#33287;&#21129;&#32186;&#29748;&#23567;&#32068;&#32080;&#28858;&#36899;&#29702;&#65292;&#20849;&#32946;&#26377;&#20108;&#23376;&#20108;&#22899;&#12290;&#38263;&#22899;&#40643;&#29667;(Jade)&#30446;&#21069;&#20219;&#32887;&#38651;&#33126;&#39015;&#21839;&#20844;&#21496;IT&#37096;&#38272;&#32147;&#29702;&#12290;&#21435;&#24180;&#19971;&#26376;&#33287;&#29579;&#38263;&#27888;(Patrick)&#32080;&#23130;&#65292;&#29287;&#24107;&#35242;&#33258;&#28858;&#22899;&#20818;&#35657;&#23130;&#65292;&#29563;&#35433;&#65292;&#26366;&#20659;&#28858;&#32654;&#35527;&#12290;&#38263;&#23376;&#40643;&#19990;&#36066;(Shane)&#65292;&#24503;&#24030;&#22823;&#23416;&#21746;&#23416;&#31995;&#30050;&#26989;&#65292;&#29694;&#23601;&#35712;&#32654;&#22283;&#22283;&#38450;&#35486;&#35328;&#23416;&#38498;&#65292;&#32380;&#32396;&#35486;&#25991;&#36914;&#38542;&#35347;&#32244;&#12290;&#27425;&#22899;&#40643;&#29771;(Charlotte)&#65292;&#29694;&#28858; 
        DullesHigh&#30340;&#20061;&#24180;&#32026;&#23416;&#29983;&#12290;&#24188;&#23376;&#40643;&#19990;&#30922;(Christian)&#65292;&#21083;&#28415;&#21313;&#27506;&#12290;&#24107;&#27597;&#24319;&#22810;&#24180;&#20358;&#38500;&#20102;&#30456;&#22827;&#25945;&#23376;&#20043;&#22806;&#65292;&#20173;&#20840;&#26041;&#20301;&#25237;&#36523;&#26044;&#25945;&#26371;&#30340;&#24037;&#20316;&#21450;&#31038;&#21312;&#30340;&#27963;&#21205;&#65292;&#26159;&#22823;&#23478;&#20844;&#35469;&#30340;&#36066;&#22971;&#33391;&#27597;&#12290; 
      </p>
      <p> &#29287;&#24107;&#19968;&#29983;&#22909;&#23416;&#22909;&#21205;&#65292;&#22810;&#24425;&#22810;&#23039;&#65307;&#29983;&#24615;&#27963;&#28497;&#12289;&#39080;&#36259;&#24189;&#40664;&#65307;&#36275;&#26234;&#22810;&#35584;&#65292;&#38728;&#24039;&#32880;&#31310;&#12290;&#24859;&#22909;&#38899;&#27138;&#65292;&#21916;&#24859;&#36939;&#21205;&#12290;&#29287;&#24107;&#19968;&#29983;&#31435;&#24535;&#32173;&#35703;&#21644;&#24179;&#65292;&#20280;&#24373;&#22823;&#24859;&#65292;&#24076;&#26395;&#23559;&#20358;&#33021;&#36914;&#20837;&#20013;&#22283;&#23459;&#25945;&#65292;&#26381;&#21209;&#26044;&#24369;&#21218;&#22296;&#39636;&#21450;&#26063;&#32676;&#20043;&#20013;&#12290;&#36817;&#24180;&#20358;&#65292;&#24478;&#26410;&#38291;&#26039;&#22320;&#21040;&#24503;&#24030;&#21508;&#23567;&#25945;&#26371;&#20659;&#25562;&#31070;&#30340;&#31119;&#38899;&#65292;&#20063;&#32147;&#24120;&#21443;&#33287;&#31038;&#21312;&#30340;&#27963;&#21205;&#12290;&#19968;&#27969;&#30340;&#21475;&#25165;&#65292;&#19968;&#27969;&#30340;&#21488;&#39080;&#65307;&#20778;&#32654;&#30340;&#32882;&#38899;&#65292;&#39080;&#36259;&#30340;&#31505;&#35441;&#65292;&#20961;&#29287;&#24107;&#25152;&#22312;&#20043;&#34389;&#65292;&#28961;&#19981;&#30041;&#19979;&#27489;&#24841;&#30340;&#27683;&#27675;&#65292;&#20196;&#20154;&#25079;&#24565;&#12290;</p>
      <p> &#29287;&#24107;&#24927;&#26044;&#20108;OO&#20845;&#24180;&#19977;&#26376;&#21313;&#20108;&#26085;&#12290;&#22312;&#37679;&#24853;&#21450;&#39514;&#22151;&#20013;&#65292;&#29287;&#24107;&#33945;&#20027;&#23541;&#21484;&#65292;&#24687;&#20102;&#22320;&#19978;&#19968;&#20999;&#21214;&#33510;&#65292;&#23433;&#24687;&#22312;&#20027;&#30340;&#25079;&#35041;&#12290;&#30041;&#32102;&#22312;&#22320;&#19978;&#25152;&#26377;&#24859;&#35703;&#21644;&#24859;&#24917;&#20182;&#30340;&#20154;&#65292;&#21482;&#26159;&#25976;&#19981;&#30433;&#30340;&#35441;&#38988;&#65292;&#36947;&#19981;&#30433;&#30340;&#25925;&#20107;&#65292;&#26356;&#26377;&#28961;&#38480;&#30340;&#24779;&#24796;&#21644;&#27704;&#36960;&#30340;&#25079;&#24565;. 
      </p>
      <p align="left">&nbsp;</p>
	  <p></p>
      <p><strong><a name="multimedia"></a></strong> </p>
      <p align="center"><span class="inner-page-content-title-sub">Multimedia 
        - Rev.Huang's Singing</span></p>
      <p align="center"><strong>Funeral Clip - Immediate members of the family 
        pay their respects and a tape recording of Rev. Huang singing &quot;He 
        Touched Me,&quot; by Bill Gaither, is played</strong>. </p>
      <p align="center"> 
        <embed src="http://video.google.com/googleplayer.swf?docId=3887768719682524878&hl=en" align="bottom" style="width:400px; height:326px;" id="VideoPlayback" type="application/x-shockwave-flash" name=""> 
        </embed></p>
      <p align="center">If video above doesn't work, click here:: <a href="http://video.google.com/videoplay?docid=3887768719682524878&hl=en">http://video.google.com/videoplay?docid=3887768719682524878&amp;hl=en</a></p>
      <p align="center">&nbsp;</p>
      <p align="center"><strong>Daughter's Wedding Clip - Rev. Huang's daughter 
        requested him to sing &quot;Becauase&quot; by Luciano Pavarati at her 
        wedding. This was the same song he sang to his own wife, Lena, at their 
        wedding when she walked down the aisle. </strong></p>
      <p align="center"> 
        <embed src="http://video.google.com/googleplayer.swf?docId=-6429663119296564654&hl=en" align="middle" style="width:400px; height:326px;" id="VideoPlayback" type="application/x-shockwave-flash"> 
        </embed></p>
      <p align="center">If video above doesn't work, click here:<a href="http://video.google.com/videoplay?docid=-6429663119296564654&hl=en"> 
        http://video.google.com/videoplay?docid=-6429663119296564654&amp;hl=en</a></p>
      <p align="center">&nbsp; 
      <p align="center"><strong>Entire Funeral Video</strong> 
      <p align="center">*we are working on getting separate video files of individual 
        songs, speeches, and eulogies, so that viewers don't have to search around 
        on a 2 hour video clip for the part that they want to watch. We hope to 
        have individual clips online soon
      <p align="center"> 
        <embed style="width:400px; height:326px;" id="VideoPlayback" type="application/x-shockwave-flash" src="http://video.google.com/googleplayer.swf?docId=-1915489796732013629&hl=en"> 
        </embed> 
      <p align="center">If video above doesn't work, click here: <a href="http://video.google.com/videoplay?docid=-1915489796732013629&hl=en">http://video.google.com/videoplay?docid=-1915489796732013629&amp;hl=en</a> 
      <p align="center"><strong><a name="photos"></a></strong> </p>
      
      <p align="center"><span class="inner-page-content-title-sub">&#29031;&#29255;</span></p>
      <p align="center"><img src="images/lifestory/1965-1.jpg" width="400" height="213"></p>
      <p align="center"><img src="images/lifestory/1965-2.jpg" width="400" height="277"></p>
      <p align="center"><img src="images/lifestory/1965-4.jpg" width="400" height="580"></p>
      <p align="center"><img src="images/lifestory/1966-1.jpg" width="400" height="582"></p>
      <p align="center"><img src="images/lifestory/1966-3.jpg" width="400" height="589"></p>
      <p align="center"><img src="images/lifestory/1966-4.jpg" width="400" height="608"></p>
      <p align="center"><img src="images/lifestory/1983-1.jpg" width="400" height="273"></p>
      <p align="center"><img src="images/lifestory/1996-2.jpg" width="400" height="224"></p>
      <p align="center"><img src="images/lifestory/2004.jpg" width="400" height="301"></p>
      <p align="center"><img src="images/lifestory/2005-99.jpg" width="400" height="265"><br>
      </p>
      <!-- InstanceEndEditable --></td>

  </tr>

  <tr>

    <td>&nbsp;</td>

  </tr>

</table>






<script src="http://www.google-analytics.com/urchin.js" type="text/javascript">
</script>
<script type="text/javascript">
_uacct = "UA-498202-2";
urchinTracker();
</script>
</body>

<!-- InstanceEnd --></html>

